tap "archivebox/archivebox"
tap "cantino/mcfly"
tap "charmbracelet/tap"
tap "heroku/brew"
tap "macos-fuse-t/cask"
tap "sidneys/homebrew"
tap "zero-sh/tap"
# Simple, modern, secure file encryption
brew "age"
# General-purpose data compression with high compression ratio
brew "xz"
# New file format for still image compression
brew "jpeg-xl"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Download with resuming and segmented downloading
brew "aria2"
# Automatic configure script builder
brew "autoconf"
# Generic library support script
brew "libtool"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Automated text file generator
brew "autogen"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# C library of Git core methods that is re-entrant and linkable
brew "libgit2"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Yet another cross-platform graphical process/system monitor
brew "bottom"
# New way to see and navigate directory trees
brew "broot"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Extract files from Microsoft cabinet files
brew "cabextract"
# Core application library for C
brew "glib"
# X.Org: Core X11 protocol client library
brew "libx11"
# Vector graphics library with cross-device output support
brew "cairo"
# CD/DVD/Blu-ray premastering and recording software
brew "cdrtools"
# CHEss OPponent Simulator
brew "cheops"
# Statistics utility to count lines of code
brew "cloc"
# Cloudflare Tunnel client (formerly Argo Tunnel)
brew "cloudflared"
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Digital camera RAW photo decoding software
brew "dcraw"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# In-depth comparison of files, archives, and directories
brew "diffoscope"
# File comparison utilities
brew "diffutils"
# Isolated development environments using Docker
brew "docker-compose"
# Disk Usage/Free Utility - a better 'df' alternative
brew "duf"
# Interactive program to find and remove duplicate files
brew "dupseek"
# More intuitive version of du in rust
brew "dust"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Modern, maintained replacement for ls
brew "eza"
# Efficient Duplicate File Finder
brew "fclones"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Identify or delete duplicate files
brew "fdupes"
# Ogg Bitstream Library
brew "libogg"
# Free lossless audio codec
brew "flac"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# OpenType text shaping engine
brew "harfbuzz"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Vorbis general audio compression codec
brew "libvorbis"
# MP3 player for Linux and UNIX
brew "mpg123"
# Audio codec
brew "opus"
# Framework for layout and rendering of i18n text
brew "pango"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Process Management Interface for HPC environments
brew "pmix"
# High performance message passing library
brew "open-mpi"
# Collection of GNU find, xargs, and locate
brew "findutils"
# Command-line tools for fly.io services
brew "flyctl"
# Terminal JSON viewer
brew "fx"
# Command-line fuzzy finder written in Go
brew "fzf"
# Google Drive CLI Client
brew "gdrive"
# Platform built on V8 to build network applications
brew "node"
# Interact with Google Gemini AI models from the command-line
brew "gemini-cli"
# GitHub command-line tool
brew "gh"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Git extension for versioning large files
brew "git-lfs"
# Render markdown on the CLI
brew "glow"
# Assuan IPC Library
brew "libassuan"
# Multimedia framework for research and academic purposes
brew "gpac"
# GNU grep, egrep and fgrep
brew "grep"
# Tool for glamorous shell scripts
brew "gum"
# Open-source video transcoder available for Linux, Mac, and Windows
brew "handbrake"
# Convert HTML to Markdown
brew "html2markdown"
# Improved top (interactive process viewer)
brew "htop"
# CLI tool for sr.ht
brew "hut"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Duplicate file finder and an enhanced fork of 'fdupes'
brew "jdupes"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Simple terminal UI for git commands
brew "lazygit"
# Shared library for mediainfo
brew "libmediainfo"
# Postgres C API library
brew "libpq"
# Next-gen compiler infrastructure
brew "llvm"
# Friendly wrapper for launchctl
brew "lunchy"
# Text-based web browser
brew "lynx"
# Mac App Store command-line interface
brew "mas"
# Unified display of technical and tag data for audio/video
brew "media-info"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Lightweight PDF and XPS viewer
brew "mupdf"
# NCurses Disk Usage
brew "ncdu"
# Netlify command-line tool
brew "netlify-cli"
# Port scanning utility for large networks
brew "nmap"
# Tiny, lightning fast, feature-packed file manager
brew "nnn"
# Optimized BLAS library
brew "openblas"
# Package for scientific computing with Python
brew "numpy"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Open Visual Inference And Optimization toolkit for AI inference
brew "openvino"
# Highly capable, feature-rich programming language
brew "perl"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Object-relational database system
brew "postgresql@15", restart_service: :changed
# Modern replacement for ps written in Rust
brew "procs"
# Monitor data's progress through a pipe
brew "pv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# Rsync for cloud storage
brew "rclone"
# RC file (dotfile) management
brew "rcm"
# Find duplicate files based on content (NOT file names)
brew "rdfind"
# Persistent key-value database, with built-in net interface
brew "redis", restart_service: :changed
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Utility that provides fast incremental file transfer
brew "rsync"
# SOund eXchange: universal sound sample translator
brew "sox"
# Zsh prompt for Astronauts
brew "spaceship"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Cross-shell prompt for astronauts
brew "starship"
# Strong open-source chess engine
brew "stockfish"
# Easiest, most secure way to use WireGuard and 2FA
brew "tailscale"
# User interface to the TELNET protocol
brew "telnet"
# Powerful free data recovery utility
brew "testdisk"
# Code-search similar to ack
brew "the_silver_searcher"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Minimal zsh prompt
brew "typewritten"
# CLI time zone visualizer
brew "tz"
# Bi-directional conversion between UTF-8 and various ASCII flavors
brew "uni2ascii"
# Vi 'workalike' with many additional features
brew "vim"
# Wave-to-notes transcriber
brew "waon"
# Watch files and take action when they change
brew "watchman"
# Internet file retriever
brew "wget"
# Library to create, extract, and modify Windows Imaging files
brew "wimlib"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# General-purpose lossless data-compression library
brew "zlib"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Additional completion definitions for zsh
brew "zsh-completions"
# The Charm Tool and Library 🌟
brew "charmbracelet/tap/charm"
# Backup and restore Ed25519 SSH keys with seed words
brew "charmbracelet/tap/melt"
# A personal key value store 🛼
brew "charmbracelet/tap/skate"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# Small tool to set macOS user defaults from a YAML file
brew "zero-sh/tap/apply-user-defaults"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# Collection of apps and services for photography, design, video, web, and UX
cask "adobe-creative-cloud"
# Watch local content on Apple TV and Chromecast
cask "airflow"
# Local-first and end-to-end encrypted notes app
cask "anytype"
# Application uninstaller
cask "appcleaner"
# Multi-track audio editor and recorder
cask "audacity"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# Menu bar icon organiser
cask "bartender"
# 3D creation suite
cask "blender"
# Web browser focusing on privacy
cask "brave-browser"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Anthropic's official Claude AI desktop app
cask "claude"
# Screen capturing tool
cask "cleanshot"
# Node-based image, video and audio generator
cask "comfyui"
# Multi-platform client-side cloud file encryption tool
cask "cryptomator"
# Write, edit, and chat about your code with AI
cask "cursor"
# Server and cloud storage browser
cask "cyberduck"
# Disk space visualiser
cask "daisydisk"
# Run Stable Diffusion locally
cask "diffusionbee"
# Voice and text chat software
cask "discord"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Matrix collaboration client
cask "element"
# Collaborative team software
cask "figma"
# Web browser
cask "firefox"
cask "font-anonymice-nerd-font"
cask "font-anonymous-pro"
cask "font-barlow"
cask "font-blex-mono-nerd-font"
cask "font-cascadia-code"
cask "font-cascadia-mono"
cask "font-caskaydia-cove-nerd-font"
cask "font-chivo"
cask "font-code-new-roman-nerd-font"
cask "font-cousine"
cask "font-cousine-nerd-font"
cask "font-dm-mono"
cask "font-droid-sans-mono-nerd-font"
cask "font-epilogue"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-fira-mono"
cask "font-fira-mono-nerd-font"
cask "font-fira-sans"
cask "font-flow-block"
cask "font-flow-circular"
cask "font-flow-rounded"
cask "font-geist"
cask "font-geist-mono"
cask "font-geist-mono-nerd-font"
cask "font-hack"
cask "font-hack-nerd-font"
cask "font-hubot-sans"
cask "font-ia-writer-duo"
cask "font-ia-writer-mono"
cask "font-ia-writer-quattro"
cask "font-ibm-plex-math"
cask "font-ibm-plex-mono"
cask "font-ibm-plex-sans"
cask "font-ibm-plex-sans-condensed"
cask "font-ibm-plex-serif"
cask "font-im-writing-nerd-font"
cask "font-inconsolata"
cask "font-inconsolata-nerd-font"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-libre-baskerville"
cask "font-libre-bodoni"
cask "font-libre-caslon-display"
cask "font-libre-caslon-text"
cask "font-libre-franklin"
cask "font-lilex"
cask "font-lilex-nerd-font"
cask "font-mona-sans"
cask "font-monaspace"
cask "font-monaspice-nerd-font"
cask "font-noto-mono"
cask "font-noto-nerd-font"
cask "font-noto-sans"
cask "font-noto-sans-mono"
cask "font-nova-mono"
cask "font-open-sans"
cask "font-overpass"
cask "font-overpass-nerd-font"
cask "font-plus-jakarta-sans"
cask "font-pt-sans"
cask "font-pt-serif"
cask "font-quattrocento-sans"
cask "font-recursive"
cask "font-recursive-code"
cask "font-red-hat-display"
cask "font-red-hat-mono"
cask "font-red-hat-text"
cask "font-roboto-mono"
cask "font-roboto-mono-nerd-font"
cask "font-sauce-code-pro-nerd-font"
cask "font-sf-mono"
cask "font-source-code-pro"
cask "font-source-sans-3"
cask "font-space-grotesk"
cask "font-space-mono"
cask "font-space-mono-nerd-font"
cask "font-victor-mono"
cask "font-victor-mono-nerd-font"
cask "font-work-sans"
# For Fujifilm GFX/X series camera tether shooting
cask "fujifilm-tether-app"
# Convert RAW images captured with Fujifilm cameras
cask "fujifilm-x-raw-studio"
# SSHFS implementation based on FUSE-T
cask "fuse-t-sshfs"
# Hosts file editor/manager
cask "gas-mask"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "gcloud-cli"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Desktop client for GitHub repositories
cask "github"
# Game development engine
cask "godot"
# Web browser
cask "google-chrome"
# Client for the Google Drive storage service
cask "google-drive"
# Tools to protect your emails and files
cask "gpg-suite"
# Run LLMs locally
cask "gpt4all"
# Open-source video transcoder
cask "handbrake-app"
# Hex editor focussing on speed
cask "hex-fiend"
# Tool to optimise images to a smaller size
cask "imageoptim"
# Vector graphics editor
cask "inkscape"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Keyboard customiser
cask "karabiner-elements"
# Desktop shield and keystroke interceptor
cask "keyboard-cleaner"
# Electronics design automation suite
cask "kicad"
# Discover, download, and run local LLMs
cask "lm-studio"
# Open-source cross-platform alternative to AirDrop
cask "localsend"
# Screen and video recording software
cask "loom"
# File system integration
cask "macfuse"
# Native desktop app for Messenger (formerly Facebook Messenger)
cask "messenger"
# Mounts servers and cloud storages as a disk on the desktop
cask "mountain-duck"
# Web browser focused on privacy and on minimizing tracking and fingerprinting
cask "mullvad-browser"
# Administration tool for Native Instruments products
cask "native-access"
# App to write, plan, collaborate, and get organised
cask "notion"
# Get up and running with large language models locally
cask "ollama-app"
# Audiobook manager for Audible users
cask "openaudible"
# ZFS driver and utilities
cask "openzfs"
# MIDI and OSC Monitor
cask "protokol"
# Client for Proton Drive
cask "proton-drive"
# Bridges Proton Mail to email clients supporting IMAP and SMTP protocols
cask "proton-mail-bridge"
# VPN client focusing on security
cask "protonvpn"
# G-code generator for 3D printers (RepRap, Makerbot, Ultimaker etc.)
cask "prusaslicer"
# Imaging utility to install operating systems to a microSD card
cask "raspberry-pi-imager"
# Control your tools with a few keystrokes
cask "raycast"
# Ebook reader
cask "readest"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Free Dj app to prepare and manage your music files
cask "rekordbox"
# MySQL/MariaDB database management
cask "sequel-ace"
# Instant messaging application focusing on security
cask "signal"
# Team communication and collaboration software
cask "slack"
# 3D printing software
cask "snapmaker-luban"
# Music streaming service
cask "spotify"
# Video game digital distribution service
cask "steam"
# Open-source media center
cask "stremio"
# Unpacks archive files
cask "the-unarchiver"
# Helper application for Things
cask "thingsmacsandboxhelper"
# Epub reader
cask "thorium"
# Customizable email client
cask "thunderbird"
# Utility to hide the notch
cask "topnotch"
# Web browser focusing on security
cask "tor-browser"
# MIDI and OSC Controller Software
cask "touchosc"
# Open-source BitTorrent client
cask "transmission"
# 3D printer and slicing GUI
cask "ultimaker-cura"
# Virtual machines UI using QEMU
cask "utm"
# Development environment
cask "vagrant"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Rust-based terminal
cask "warp"
# Native desktop client for WhatsApp
cask "whatsapp"
# Agentic IDE powered by AI Flow paradigm
cask "windsurf"
# Notetaking tool
cask "workflowy"
# Multiplayer code editor
cask "zed"
# Gecko based web browser
cask "zen"
# Video communication and virtual meeting platform
cask "zoom"
mas "1Password for Safari", id: 1569813296
mas "Affinity Designer 2", id: 1616831348
mas "Amphetamine", id: 937984704
mas "Blackmagic Disk Speed Test", id: 425264550
mas "Darkroom", id: 953286746
mas "djay Pro", id: 450527929
mas "GarageBand", id: 682658836
mas "GoPro Quik", id: 561350520
mas "HazeOver", id: 430798174
mas "iA Writer", id: 775737590
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Photomator", id: 1444636541
mas "Pixelmator Pro", id: 1289583905
mas "Tailscale", id: 1475387142
mas "Things", id: 904280696
vscode "1yib.rust-bundle"
vscode "ahmadawais.shades-of-purple"
vscode "alefragnani.project-manager"
vscode "aminer.codegeex"
vscode "astro-build.astro-vscode"
vscode "austenc.tailwind-docs"
vscode "basys.vscode-basys"
vscode "bibhasdn.unique-lines"
vscode "bradlc.vscode-tailwindcss"
vscode "bung87.rails"
vscode "bung87.vscode-gemfile"
vscode "ccimage.jsonviewer"
vscode "cesium.gltf-vscode"
vscode "csstools.postcss"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "dbaeumer.vscode-eslint"
vscode "dnicolson.binary-plist"
vscode "docker.docker"
vscode "dotjoshjohnson.xml"
vscode "doublebot.doublebot"
vscode "dracula-theme.theme-dracula"
vscode "dtoplak.vscode-glsllint"
vscode "dtsvet.vscode-wasm"
vscode "dustypomerleau.rust-syntax"
vscode "eamodio.gitlens"
vscode "emmanuelbeziat.vscode-great-icons"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "extemporelang.vscode-extempore"
vscode "figma.figma-vscode-extension"
vscode "fill-labs.dependi"
vscode "foxundermoon.shell-format"
vscode "gamunu.vscode-yarn"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "grapecity.gc-excelviewer"
vscode "gulajavaministudio.mayukaithemevsc"
vscode "hbenl.vscode-test-explorer"
vscode "hsnazar.hyper-term-theme"
vscode "idealley.gql"
vscode "janisdd.vscode-edit-csv"
vscode "jscearcy.rust-doc-viewer"
vscode "kumar-harsh.graphql-for-vscode"
vscode "l13rary.l13-diff"
vscode "macieklad.tailwind-sass-syntax"
vscode "mactkg.sonic-pi"
vscode "mathematic.vscode-pdf"
vscode "mechatroner.rainbow-csv"
vscode "mike-co.import-sorter"
vscode "mikestead.dotenv"
vscode "moshfeu.compare-folders"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.test-adapter-converter"
vscode "ms-vscode.vscode-speech"
vscode "nash.awesome-flutter-snippets"
vscode "octref.vetur"
vscode "openai.chatgpt"
vscode "phoenisx.cssvar"
vscode "pkosta2005.heroku-command"
vscode "prisma.prisma"
vscode "randomfractalsinc.vscode-data-preview"
vscode "redhat.vscode-yaml"
vscode "robbowen.synthwave-vscode"
vscode "ronnidc.nunjucks"
vscode "rust-lang.rust-analyzer"
vscode "rvest.vs-code-prettier-eslint"
vscode "shopify.ruby-lsp"
vscode "sianglim.slim"
vscode "sissel.shopify-liquid"
vscode "slevesque.shader"
vscode "sourcegraph.cody-ai"
vscode "svelte.svelte-vscode"
vscode "swellaby.vscode-rust-test-adapter"
vscode "tamasfe.even-better-toml"
vscode "tidalcycles.vscode-tidalcycles"
vscode "tobiah.language-pde"
vscode "tyriar.sort-lines"
vscode "vscodevim.vim"
vscode "vue.volar"
vscode "yzhang.markdown-all-in-one"
