tap "archivebox/archivebox"
tap "cantino/mcfly"
tap "charmbracelet/tap"
tap "heroku/brew"
tap "macos-fuse-t/cask"
tap "sidneys/homebrew"
tap "zero-sh/tap"
brew "age"  # Simple, modern, secure file encryption
brew "xz"  # General-purpose data compression with high compression ratio
brew "jpeg-xl"  # New file format for still image compression
brew "aom"  # Codec library for encoding and decoding AV1 video streams
brew "aria2"  # Download with resuming and segmented downloading
brew "autoconf"  # Automatic configure script builder
brew "libtool"  # Generic library support script
brew "pkgconf"  # Package compiler and linker metadata toolkit
brew "autogen"  # Automated text file generator
brew "automake"  # Tool for generating GNU Standards-compliant Makefiles
brew "libgit2"  # C library of Git core methods that is re-entrant and linkable
brew "bat"  # Clone of cat(1) with syntax highlighting and Git integration
brew "bottom"  # Yet another cross-platform graphical process/system monitor
brew "broot"  # New way to see and navigate directory trees
brew "btop"  # Resource monitor. C++ version and continuation of bashtop and bpytop
brew "cabextract"  # Extract files from Microsoft cabinet files
brew "glib"  # Core application library for C
brew "libx11"  # X.Org: Core X11 protocol client library
brew "cairo"  # Vector graphics library with cross-device output support
brew "cdrtools"  # CD/DVD/Blu-ray premastering and recording software
brew "cheops"  # CHEss OPponent Simulator
brew "cloc"  # Statistics utility to count lines of code
brew "cloudflared"  # Cloudflare Tunnel client (formerly Argo Tunnel)
brew "cmake"  # Cross-platform make
brew "coreutils"  # GNU File, Shell, and Text utilities
brew "dcraw"  # Digital camera RAW photo decoding software
brew "diff-so-fancy"  # Good-lookin' diffs with diff-highlight and more
brew "diffoscope"  # In-depth comparison of files, archives, and directories
brew "diffutils"  # File comparison utilities
brew "docker-compose"  # Isolated development environments using Docker
brew "duf"  # Disk Usage/Free Utility - a better 'df' alternative
brew "dupseek"  # Interactive program to find and remove duplicate files
brew "dust"  # More intuitive version of du in rust
brew "exiftool"  # Perl lib for reading and writing EXIF metadata
brew "eza"  # Modern, maintained replacement for ls
brew "fclones"  # Efficient Duplicate File Finder
brew "fd"  # Simple, fast and user-friendly alternative to find
brew "fdupes"  # Identify or delete duplicate files
brew "libogg"  # Ogg Bitstream Library
brew "flac"  # Free lossless audio codec
brew "unbound"  # Validating, recursive, caching DNS resolver
brew "gnutls"  # GNU Transport Layer Security (TLS) Library
brew "harfbuzz"  # OpenType text shaping engine
brew "libass"  # Subtitle renderer for the ASS/SSA subtitle format
brew "libvorbis"  # Vorbis general audio compression codec
brew "mpg123"  # MP3 player for Linux and UNIX
brew "opus"  # Audio codec
brew "pango"  # Framework for layout and rendering of i18n text
brew "tesseract"  # OCR (Optical Character Recognition) engine
brew "ffmpeg"  # Play, record, convert, and stream audio and video
brew "pmix"  # Process Management Interface for HPC environments
brew "open-mpi"  # High performance message passing library
brew "findutils"  # Collection of GNU find, xargs, and locate
brew "flyctl"  # Command-line tools for fly.io services
brew "fx"  # Terminal JSON viewer
brew "fzf"  # Command-line fuzzy finder written in Go
brew "gdrive"  # Google Drive CLI Client
brew "node"  # Platform built on V8 to build network applications
brew "gemini-cli"  # Interact with Google Gemini AI models from the command-line
brew "gh"  # GitHub command-line tool
brew "ghostscript"  # Interpreter for PostScript and PDF
brew "git"  # Distributed revision control system
brew "git-delta"  # Syntax-highlighting pager for git and diff output
brew "git-lfs"  # Git extension for versioning large files
brew "glow"  # Render markdown on the CLI
brew "libassuan"  # Assuan IPC Library
brew "gpac"  # Multimedia framework for research and academic purposes
brew "grep"  # GNU grep, egrep and fgrep
brew "gum"  # Tool for glamorous shell scripts
brew "handbrake"  # Open-source video transcoder available for Linux, Mac, and Windows
brew "html2markdown"  # Convert HTML to Markdown
brew "htop"  # Improved top (interactive process viewer)
brew "hut"  # CLI tool for sr.ht
brew "libheif"  # ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "imagemagick"  # Tools and libraries to manipulate images in many formats
brew "jdupes"  # Duplicate file finder and an enhanced fork of 'fdupes'
brew "jq"  # Lightweight and flexible command-line JSON processor
brew "kubernetes-cli"  # Kubernetes command-line interface
brew "lazygit"  # Simple terminal UI for git commands
brew "libmediainfo"  # Shared library for mediainfo
brew "libpq"  # Postgres C API library
brew "llvm"  # Next-gen compiler infrastructure
brew "lunchy"  # Friendly wrapper for launchctl
brew "lynx"  # Text-based web browser
brew "mas"  # Mac App Store command-line interface
brew "media-info"  # Unified display of technical and tag data for audio/video
brew "mise"  # Polyglot runtime manager (asdf rust clone)
brew "mupdf"  # Lightweight PDF and XPS viewer
brew "ncdu"  # NCurses Disk Usage
brew "netlify-cli"  # Netlify command-line tool
brew "nmap"  # Port scanning utility for large networks
brew "nnn"  # Tiny, lightning fast, feature-packed file manager
brew "openblas"  # Optimized BLAS library
brew "numpy"  # Package for scientific computing with Python
brew "protobuf"  # Protocol buffers (Google's data interchange format)
brew "openvino"  # Open Visual Inference And Optimization toolkit for AI inference
brew "perl"  # Highly capable, feature-rich programming language
brew "pinentry-mac"  # Pinentry for GPG on Mac
brew "postgresql@15", restart_service: :changed  # Object-relational database system
brew "procs"  # Modern replacement for ps written in Rust
brew "pv"  # Monitor data's progress through a pipe
brew "python@3.10"  # Interpreted, interactive, object-oriented programming language
brew "python@3.11"  # Interpreted, interactive, object-oriented programming language
brew "python@3.12"  # Interpreted, interactive, object-oriented programming language
brew "ruby-build"  # Install various Ruby versions and implementations
brew "rbenv"  # Ruby version manager
brew "rclone"  # Rsync for cloud storage
brew "rcm"  # RC file (dotfile) management
brew "rdfind"  # Find duplicate files based on content (NOT file names)
brew "redis", restart_service: :changed  # Persistent key-value database, with built-in net interface
brew "ripgrep"  # Search tool like grep and The Silver Searcher
brew "rsync"  # Utility that provides fast incremental file transfer
brew "sox"  # SOund eXchange: universal sound sample translator
brew "spaceship"  # Zsh prompt for Astronauts
brew "speedtest-cli"  # Command-line interface for https://speedtest.net bandwidth tests
brew "starship"  # Cross-shell prompt for astronauts
brew "stockfish"  # Strong open-source chess engine
brew "tailscale"  # Easiest, most secure way to use WireGuard and 2FA
brew "telnet"  # User interface to the TELNET protocol
brew "testdisk"  # Powerful free data recovery utility
brew "the_silver_searcher"  # Code-search similar to ack
brew "tree"  # Display directories as trees (with optional color/HTML output)
brew "typewritten"  # Minimal zsh prompt
brew "tz"  # CLI time zone visualizer
brew "uni2ascii"  # Bi-directional conversion between UTF-8 and various ASCII flavors
brew "vim"  # Vi 'workalike' with many additional features
brew "waon"  # Wave-to-notes transcriber
brew "watchman"  # Watch files and take action when they change
brew "wget"  # Internet file retriever
brew "wimlib"  # Library to create, extract, and modify Windows Imaging files
brew "yt-dlp"  # Feature-rich command-line audio/video downloader
brew "zlib"  # General-purpose lossless data-compression library
brew "zoxide"  # Shell extension to navigate your filesystem faster
brew "zsh-completions"  # Additional completion definitions for zsh
brew "charmbracelet/tap/charm"  # The Charm Tool and Library 🌟
brew "charmbracelet/tap/melt"  # Backup and restore Ed25519 SSH keys with seed words
brew "charmbracelet/tap/skate"  # A personal key value store 🛼
brew "heroku/brew/heroku"  # Everything you need to get started with Heroku
brew "zero-sh/tap/apply-user-defaults"  # Small tool to set macOS user defaults from a YAML file
cask "1password"  # Password manager that keeps all passwords secure behind one password
cask "1password-cli"  # Command-line interface for 1Password
cask "adobe-creative-cloud"  # Collection of apps and services for photography, design, video, web, and UX
cask "airflow"  # Watch local content on Apple TV and Chromecast
cask "anytype"  # Local-first and end-to-end encrypted notes app
cask "appcleaner"  # Application uninstaller
cask "audacity"  # Multi-track audio editor and recorder
cask "balenaetcher"  # Tool to flash OS images to SD cards & USB drives
cask "bartender"  # Menu bar icon organiser
cask "blender"  # 3D creation suite
cask "brave-browser"  # Web browser focusing on privacy
cask "chatgpt"  # OpenAI's official ChatGPT desktop app
cask "claude"  # Anthropic's official Claude AI desktop app
cask "cleanshot"  # Screen capturing tool
cask "comfyui"  # Node-based image, video and audio generator
cask "cryptomator"  # Multi-platform client-side cloud file encryption tool
cask "cursor"  # Write, edit, and chat about your code with AI
cask "cyberduck"  # Server and cloud storage browser
cask "daisydisk"  # Disk space visualiser
cask "diffusionbee"  # Run Stable Diffusion locally
cask "discord"  # Voice and text chat software
cask "docker-desktop"  # App to build and share containerised applications and microservices
cask "element"  # Matrix collaboration client
cask "figma"  # Collaborative team software
cask "firefox"  # Web browser
cask "font-anonymice-nerd-font"
cask "font-anonymous-pro"
cask "font-barlow"
cask "font-blex-mono-nerd-font"
cask "font-cascadia-code"
cask "font-cascadia-mono"
cask "font-caskaydia-cove-nerd-font"
cask "font-chivo"
cask "font-code-new-roman-nerd-font"
cask "font-cousine"
cask "font-cousine-nerd-font"
cask "font-dm-mono"
cask "font-droid-sans-mono-nerd-font"
cask "font-epilogue"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-fira-mono"
cask "font-fira-mono-nerd-font"
cask "font-fira-sans"
cask "font-flow-block"
cask "font-flow-circular"
cask "font-flow-rounded"
cask "font-geist"
cask "font-geist-mono"
cask "font-geist-mono-nerd-font"
cask "font-hack"
cask "font-hack-nerd-font"
cask "font-hubot-sans"
cask "font-ia-writer-duo"
cask "font-ia-writer-mono"
cask "font-ia-writer-quattro"
cask "font-ibm-plex-math"
cask "font-ibm-plex-mono"
cask "font-ibm-plex-sans"
cask "font-ibm-plex-sans-condensed"
cask "font-ibm-plex-serif"
cask "font-im-writing-nerd-font"
cask "font-inconsolata"
cask "font-inconsolata-nerd-font"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-libre-baskerville"
cask "font-libre-bodoni"
cask "font-libre-caslon-display"
cask "font-libre-caslon-text"
cask "font-libre-franklin"
cask "font-lilex"
cask "font-lilex-nerd-font"
cask "font-mona-sans"
cask "font-monaspace"
cask "font-monaspice-nerd-font"
cask "font-noto-mono"
cask "font-noto-nerd-font"
cask "font-noto-sans"
cask "font-noto-sans-mono"
cask "font-nova-mono"
cask "font-open-sans"
cask "font-overpass"
cask "font-overpass-nerd-font"
cask "font-plus-jakarta-sans"
cask "font-pt-sans"
cask "font-pt-serif"
cask "font-quattrocento-sans"
cask "font-recursive"
cask "font-recursive-code"
cask "font-red-hat-display"
cask "font-red-hat-mono"
cask "font-red-hat-text"
cask "font-roboto-mono"
cask "font-roboto-mono-nerd-font"
cask "font-sauce-code-pro-nerd-font"
cask "font-sf-mono"
cask "font-source-code-pro"
cask "font-source-sans-3"
cask "font-space-grotesk"
cask "font-space-mono"
cask "font-space-mono-nerd-font"
cask "font-victor-mono"
cask "font-victor-mono-nerd-font"
cask "font-work-sans"
cask "fujifilm-tether-app"  # For Fujifilm GFX/X series camera tether shooting
cask "fujifilm-x-raw-studio"  # Convert RAW images captured with Fujifilm cameras
cask "fuse-t-sshfs"  # SSHFS implementation based on FUSE-T
cask "gas-mask"  # Hosts file editor/manager
cask "gcloud-cli"  # Set of tools to manage resources and applications hosted on Google Cloud
cask "ghostty"  # Terminal emulator that uses platform-native UI and GPU acceleration
cask "github"  # Desktop client for GitHub repositories
cask "godot"  # Game development engine
cask "google-chrome"  # Web browser
cask "google-drive"  # Client for the Google Drive storage service
cask "gpg-suite"  # Tools to protect your emails and files
cask "gpt4all"  # Run LLMs locally
cask "handbrake-app"  # Open-source video transcoder
cask "hex-fiend"  # Hex editor focussing on speed
cask "imageoptim"  # Tool to optimise images to a smaller size
cask "inkscape"  # Vector graphics editor
cask "iterm2"  # Terminal emulator as alternative to Apple's Terminal app
cask "karabiner-elements"  # Keyboard customiser
cask "keyboard-cleaner"  # Desktop shield and keystroke interceptor
cask "kicad"  # Electronics design automation suite
cask "lm-studio"  # Discover, download, and run local LLMs
cask "localsend"  # Open-source cross-platform alternative to AirDrop
cask "loom"  # Screen and video recording software
cask "macfuse"  # File system integration
cask "messenger"  # Native desktop app for Messenger (formerly Facebook Messenger)
cask "mountain-duck"  # Mounts servers and cloud storages as a disk on the desktop
cask "mullvad-browser"  # Web browser focused on privacy and on minimizing tracking and fingerprinting
cask "native-access"  # Administration tool for Native Instruments products
cask "notion"  # App to write, plan, collaborate, and get organised
cask "ollama-app"  # Get up and running with large language models locally
cask "openaudible"  # Audiobook manager for Audible users
cask "openzfs"  # ZFS driver and utilities
cask "protokol"  # MIDI and OSC Monitor
cask "proton-drive"  # Client for Proton Drive
cask "proton-mail-bridge"  # Bridges Proton Mail to email clients supporting IMAP and SMTP protocols
cask "protonvpn"  # VPN client focusing on security
cask "prusaslicer"  # G-code generator for 3D printers (RepRap, Makerbot, Ultimaker etc.)
cask "raspberry-pi-imager"  # Imaging utility to install operating systems to a microSD card
cask "raycast"  # Control your tools with a few keystrokes
cask "readest"  # Ebook reader
cask "rectangle"  # Move and resize windows using keyboard shortcuts or snap areas
cask "rekordbox"  # Free Dj app to prepare and manage your music files
cask "sequel-ace"  # MySQL/MariaDB database management
cask "signal"  # Instant messaging application focusing on security
cask "slack"  # Team communication and collaboration software
cask "snapmaker-luban"  # 3D printing software
cask "spotify"  # Music streaming service
cask "steam"  # Video game digital distribution service
cask "stremio"  # Open-source media center
cask "the-unarchiver"  # Unpacks archive files
cask "thingsmacsandboxhelper"  # Helper application for Things
cask "thorium"  # Epub reader
cask "thunderbird"  # Customizable email client
cask "topnotch"  # Utility to hide the notch
cask "tor-browser"  # Web browser focusing on security
cask "touchosc"  # MIDI and OSC Controller Software
cask "transmission"  # Open-source BitTorrent client
cask "ultimaker-cura"  # 3D printer and slicing GUI
cask "utm"  # Virtual machines UI using QEMU
cask "vagrant"  # Development environment
cask "visual-studio-code"  # Open-source code editor
cask "vlc"  # Multimedia player
cask "warp"  # Rust-based terminal
cask "whatsapp"  # Native desktop client for WhatsApp
cask "windsurf"  # Agentic IDE powered by AI Flow paradigm
cask "workflowy"  # Notetaking tool
cask "zed"  # Multiplayer code editor
cask "zen"  # Gecko based web browser
cask "zoom"  # Video communication and virtual meeting platform
mas "1Password for Safari", id: 1569813296
mas "Affinity Designer 2", id: 1616831348
mas "Amphetamine", id: 937984704
mas "Blackmagic Disk Speed Test", id: 425264550
mas "Darkroom", id: 953286746
mas "djay Pro", id: 450527929
mas "GarageBand", id: 682658836
mas "GoPro Quik", id: 561350520
mas "HazeOver", id: 430798174
mas "iA Writer", id: 775737590
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Photomator", id: 1444636541
mas "Pixelmator Pro", id: 1289583905
mas "Tailscale", id: 1475387142
mas "Things", id: 904280696
vscode "1yib.rust-bundle"
vscode "ahmadawais.shades-of-purple"
vscode "alefragnani.project-manager"
vscode "aminer.codegeex"
vscode "astro-build.astro-vscode"
vscode "austenc.tailwind-docs"
vscode "basys.vscode-basys"
vscode "bibhasdn.unique-lines"
vscode "bradlc.vscode-tailwindcss"
vscode "bung87.rails"
vscode "bung87.vscode-gemfile"
vscode "ccimage.jsonviewer"
vscode "cesium.gltf-vscode"
vscode "csstools.postcss"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "dbaeumer.vscode-eslint"
vscode "dnicolson.binary-plist"
vscode "docker.docker"
vscode "dotjoshjohnson.xml"
vscode "doublebot.doublebot"
vscode "dracula-theme.theme-dracula"
vscode "dtoplak.vscode-glsllint"
vscode "dtsvet.vscode-wasm"
vscode "dustypomerleau.rust-syntax"
vscode "eamodio.gitlens"
vscode "emmanuelbeziat.vscode-great-icons"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "extemporelang.vscode-extempore"
vscode "figma.figma-vscode-extension"
vscode "fill-labs.dependi"
vscode "foxundermoon.shell-format"
vscode "gamunu.vscode-yarn"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "grapecity.gc-excelviewer"
vscode "gulajavaministudio.mayukaithemevsc"
vscode "hbenl.vscode-test-explorer"
vscode "hsnazar.hyper-term-theme"
vscode "idealley.gql"
vscode "janisdd.vscode-edit-csv"
vscode "jscearcy.rust-doc-viewer"
vscode "kumar-harsh.graphql-for-vscode"
vscode "l13rary.l13-diff"
vscode "macieklad.tailwind-sass-syntax"
vscode "mactkg.sonic-pi"
vscode "mathematic.vscode-pdf"
vscode "mechatroner.rainbow-csv"
vscode "mike-co.import-sorter"
vscode "mikestead.dotenv"
vscode "moshfeu.compare-folders"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.test-adapter-converter"
vscode "ms-vscode.vscode-speech"
vscode "nash.awesome-flutter-snippets"
vscode "octref.vetur"
vscode "openai.chatgpt"
vscode "phoenisx.cssvar"
vscode "pkosta2005.heroku-command"
vscode "prisma.prisma"
vscode "randomfractalsinc.vscode-data-preview"
vscode "redhat.vscode-yaml"
vscode "robbowen.synthwave-vscode"
vscode "ronnidc.nunjucks"
vscode "rust-lang.rust-analyzer"
vscode "rvest.vs-code-prettier-eslint"
vscode "shopify.ruby-lsp"
vscode "sianglim.slim"
vscode "sissel.shopify-liquid"
vscode "slevesque.shader"
vscode "sourcegraph.cody-ai"
vscode "svelte.svelte-vscode"
vscode "swellaby.vscode-rust-test-adapter"
vscode "tamasfe.even-better-toml"
vscode "tidalcycles.vscode-tidalcycles"
vscode "tobiah.language-pde"
vscode "tyriar.sort-lines"
vscode "vscodevim.vim"
vscode "vue.volar"
vscode "yzhang.markdown-all-in-one"
