tap "cantino/mcfly"
tap "charmbracelet/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "macos-fuse-t/cask"
tap "sidneys/homebrew"
tap "zero-sh/tap"
# Simple, modern, secure file encryption
brew "age"
# General-purpose data compression with high compression ratio
brew "xz"
# New file format for still image compression
brew "jpeg-xl"
# Library for command-line editing
brew "readline"
# Download with resuming and segmented downloading
brew "aria2"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Generic library support script
brew "libtool"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Manage compile and link flags for libraries
brew "pkg-config"
# Automated text file generator
brew "autogen"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Yet another cross-platform graphical process/system monitor
brew "bottom"
# New way to see and navigate directory trees
brew "broot"
# Extract files from Microsoft cabinet files
brew "cabextract"
# X.Org: Core X11 protocol client library
brew "libx11"
# CD/DVD/Blu-ray premastering and recording software
brew "cdrtools"
# CHEss OPponent Simulator
brew "cheops"
# Cross-platform make
brew "cmake"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# In-depth comparison of files, archives, and directories
brew "diffoscope"
# File comparison utilities
brew "diffutils"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Command-line DNS client
brew "dog"
# Disk Usage/Free Utility - a better 'df' alternative
brew "duf"
# Interactive program to find and remove duplicate files
brew "dupseek"
# More intuitive version of du in rust
brew "dust"
# Modern replacement for 'ls'
brew "exa"
# Efficient Duplicate File Finder
brew "fclones"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Identify or delete duplicate files
brew "fdupes"
# Ogg Bitstream Library
brew "libogg"
# Free lossless audio codec
brew "flac"
# OpenType text shaping engine
brew "harfbuzz"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Vorbis General Audio Compression Codec
brew "libvorbis"
# MP3 player for Linux and UNIX
brew "mpg123"
# Audio codec
brew "opus"
# Framework for layout and rendering of i18n text
brew "pango"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# High performance message passing library
brew "open-mpi"
# Command-line outline and bitmap font editor/converter
brew "fontforge"
# Terminal JSON viewer
brew "fx"
# Command-line fuzzy finder written in Go
brew "fzf"
# Google Drive CLI Client
brew "gdrive"
# GitHub command-line tool
brew "gh"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Git extension for versioning large files
brew "git-lfs"
# Render markdown on the CLI
brew "glow"
# GNU grep, egrep and fgrep
brew "grep"
# Open-source video transcoder available for Linux, Mac, and Windows
brew "handbrake", link: false
# Improved top (interactive process viewer)
brew "htop"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Duplicate file finder and an enhanced fork of 'fdupes'
brew "jdupes"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Friendly wrapper for launchctl
brew "lunchy"
# Text-based web browser
brew "lynx"
# Mac App Store command-line interface
brew "mas"
# NCurses Disk Usage
brew "ncdu"
# Netlify command-line tool
brew "netlify-cli"
# Tiny, lightning fast, feature-packed file manager
brew "nnn"
# Optimized BLAS library
brew "openblas"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Modern replacement for ps written by Rust
brew "procs"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Monitor data's progress through a pipe
brew "pv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# Rsync for cloud storage
brew "rclone"
# RC file (dotfile) management
brew "rcm"
# Find duplicate files based on content (NOT file names)
brew "rdfind"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Utility that provides fast incremental file transfer
brew "rsync"
# SOund eXchange: universal sound sample translator
brew "sox"
# Zsh prompt for Astronauts
brew "spaceship"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Strong open-source chess engine
brew "stockfish"
# Powerful free data recovery utility
brew "testdisk"
# Code-search similar to ack
brew "the_silver_searcher"
# Simplified and community-driven man pages
brew "tldr"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Minimal zsh prompt
brew "typewritten"
# CLI time zone visualizer
brew "tz"
# Bi-directional conversion between UTF-8 and various ASCII flavors
brew "uni2ascii"
# Vi 'workalike' with many additional features
brew "vim"
# Wave-to-notes transcriber
brew "waon"
# Internet file retriever
brew "wget"
# Library to create, extract, and modify Windows Imaging files
brew "wimlib"
# Download YouTube videos from the command-line
brew "youtube-dl"
# General-purpose lossless data-compression library
brew "zlib"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# McFly
brew "cantino/mcfly/mcfly"
# The Charm Tool and Library 🌟
brew "charmbracelet/tap/charm"
# Backup and restore Ed25519 SSH keys with seed words
brew "charmbracelet/tap/melt"
# A personal key value store 🛼
brew "charmbracelet/tap/skate"
# Offline NT Password Editor
brew "sidneys/homebrew/chntpw"
# Small tool to set macOS user defaults from a YAML file
brew "zero-sh/tap/apply-user-defaults"
# Text editor
cask "010-editor"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line helper for the 1Password password manager
cask "1password-cli"
# Watch local content on Apple TV and Chromecast
cask "airflow"
# Memory training application
cask "anki"
# Application uninstaller
cask "appcleaner"
# Multi-cloud backup application
cask "arq"
# Multi-track audio editor and recorder
cask "audacity"
# 3D creation suite
cask "blender"
# Screen capturing tool
cask "cleanshot"
# Multi-platform client-side cloud file encryption tool
cask "cryptomator"
# Server and cloud storage browser
cask "cyberduck"
# Disk space visualizer
cask "daisydisk"
# Run Stable Diffusion locally
cask "diffusionbee"
# Voice and text chat software
cask "discord"
# Create DMGs and other archives
cask "dropdmg"
# Finds duplicate files in a computer system
cask "dupeguru"
# Matrix collaboration client
cask "element"
# Collaborative team software
cask "figma"
# Web browser
cask "firefox"
# Developer targeted fonts with a high number of glyphs
cask "font-anonymice-nerd-font"
# Programming font
cask "font-anonymous-pro"
# Developer targeted fonts with a high number of glyphs
cask "font-blex-mono-nerd-font"
# Monospaced font that includes programming ligatures
cask "font-cascadia-code"
# Version of Cascadia Code without ligatures
cask "font-cascadia-mono"
# Developer targeted fonts with a high number of glyphs
cask "font-caskaydia-cove-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-code-new-roman-nerd-font"
cask "font-cousine"
# Developer targeted fonts with a high number of glyphs
cask "font-cousine-nerd-font"
cask "font-dm-mono"
# Developer targeted fonts with a high number of glyphs
cask "font-droid-sans-mono-nerd-font"
# Free monospaced font with programming ligatures
cask "font-fira-code"
# Developer targeted fonts with a high number of glyphs
cask "font-fira-code-nerd-font"
cask "font-fira-mono"
# Developer targeted fonts with a high number of glyphs
cask "font-fira-mono-nerd-font"
cask "font-hack"
# Developer targeted fonts with a high number of glyphs
cask "font-hack-nerd-font"
cask "font-ia-writer-duo"
cask "font-ia-writer-duospace"
cask "font-ia-writer-mono"
cask "font-ia-writer-quattro"
# Corporate typeface for IBM
cask "font-ibm-plex-mono"
# Developer targeted fonts with a high number of glyphs
cask "font-im-writing-nerd-font"
cask "font-inconsolata"
# Developer targeted fonts with a high number of glyphs
cask "font-inconsolata-nerd-font"
# Typeface made for developers
cask "font-jetbrains-mono"
# Developer targeted fonts with a high number of glyphs
cask "font-jetbrains-mono-nerd-font"
# Programming font
cask "font-lilex"
# Developer targeted fonts with a high number of glyphs
cask "font-lilex-nerd-font"
cask "font-noto-mono"
# Developer targeted fonts with a high number of glyphs
cask "font-noto-nerd-font"
cask "font-noto-sans-mono"
cask "font-nova-mono"
cask "font-overpass"
# Developer targeted fonts with a high number of glyphs
cask "font-overpass-nerd-font"
# Led by arrow type, a type foundry based in brooklyn, ny, usa
cask "font-recursive"
# Recursive's prebuilt text-editor-friendly files, including powerline glyphs
cask "font-recursive-code"
cask "font-red-hat-mono"
cask "font-roboto-mono"
# Developer targeted fonts with a high number of glyphs
cask "font-roboto-mono-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-sauce-code-pro-nerd-font"
# Monospaced variant of "San Francisco" by Apple
cask "font-sf-mono"
cask "font-source-code-pro"
# Monospaced font with cursive italics and programming symbol ligatures
cask "font-victor-mono"
# Developer targeted fonts with a high number of glyphs
cask "font-victor-mono-nerd-font"
# Font editor and converter for outline and bitmap fonts
cask "fontforge"
# LibFUSE implementation that doesn't use kernel extensions
cask "fuse-t"
# SSHFS implementation based on FUSE-T
cask "fuse-t-sshfs"
# Hosts file editor/manager
cask "gas-mask"
# Desktop client for GitHub repositories
cask "github"
# Web browser
cask "google-chrome"
# Tools to protect your emails and files
cask "gpg-suite"
# Open-source video transcoder
cask "handbrake"
# Hex editor focussing on speed
cask "hex-fiend"
# Access the HEY email service
cask "hey"
# Terminal built on web technologies
cask "hyper"
# Tool to optimize images to a smaller size
cask "imageoptim"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Keyboard customizer
cask "karabiner-elements"
# Desktop shield and keystroke interceptor
cask "keyboard-cleaner"
# CAD application
cask "librecad"
# Software for Logitech devices
cask "logi-options-plus"
# Privacy-first, open-source platform for knowledge sharing and management
cask "logseq"
# File system integration
cask "macfuse"
# Open-source Dropbox client
cask "maestral"
# Web browser
cask "microsoft-edge"
# Monitor MIDI inputs and outputs
cask "midiview"
# Open-source DJ software
cask "mixxx"
# Mounts servers and cloud storages as a disk on the desktop
cask "mountain-duck"
# Open-source music notation software
cask "musescore"
# Administration tool for Native Instruments products
cask "native-access"
# Native code editor
cask "nova"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# MIDI and OSC Monitor
cask "protokol"
# Bridges Proton Mail to email clients supporting IMAP and SMTP protocols
cask "protonmail-bridge"
# VPN client focusing on security
cask "protonvpn"
# Toolbox companion for QMK Firmware
cask "qmk-toolbox"
# Imaging utility to install operating systems to a microSD card
cask "raspberry-pi-imager"
# Control your tools with a few keystrokes
cask "raycast"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# GUI for rsync
cask "rsyncosx"
# Remote desktop software
cask "screens-connect"
# Collection of apps available by subscription
cask "setapp"
# Instant messaging application focusing on security
cask "signal"
# Team communication and collaboration software
cask "slack"
# Code-based music creation and performance tool
cask "sonic-pi"
# Visualisation, analysis, and annotation of music audio recordings
cask "sonic-visualiser"
# Music streaming service
cask "spotify"
# Video game digital distribution service
cask "steam"
# Unpacks archive files
cask "the-unarchiver"
# Helper application for Things
cask "thingsmacsandboxhelper"
# Web browser focusing on security
cask "tor-browser"
# MIDI and OSC Controller Software
cask "touchosc"
# Open-source BitTorrent client
cask "transmission"
# Virtual machines UI using QEMU
cask "utm"
# Development environment
cask "vagrant"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Remote desktop application focusing on security
cask "vnc-viewer"
# Desktop client for WhatsApp
cask "whatsapp"
# Notetaking tool
cask "workflowy"
# Video communication and virtual meeting platform
cask "zoom"
